tap "elastic/tap"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "macvim-dev/macvim"
tap "rbenv/tap"
tap "stripe/stripe-cli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Perl compatible regular expressions library
brew "pcre"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNOME XML library
brew "libxml2"
# Postgres C API library
brew "libpq"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Package for scientific computing with Python
brew "numpy"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GitHub Markdown previewer
brew "grip"
# Website copier/offline browser
brew "httrack"
# Implementation of the file(1) command
brew "libmagic"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node", link: false
# Manage multiple Node.js versions
brew "nvm"
# Display the PID number for a given process name
brew "pidof"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Distributed search & analytics engine
brew "elastic/tap/elasticsearch-full"
# Analytics and search dashboard for Elasticsearch
brew "elastic/tap/kibana-full"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# SSL/TLS cryptography library
brew "rbenv/tap/openssl@1.0"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
cask "font-hack-nerd-font"
# Office suite
cask "libreoffice"
